{
  "_name_or_path": "facebook/opt-2.7b",
  "_remove_final_layer_norm": false,
  "activation_dropout": 0.0,
  "activation_function": "relu",
  "architectures": [
    "OPTForCausalLM"
  ],
  "attention_dropout": 0.0,
  "attn_head_similarity_method": "cosine",
  "attn_head_similarity_threshold": 0.8,
  "bos_token_id": 2,
  "do_layer_norm_before": true,
  "dropout": 0.1,
  "enable_attn_head_similarity": false,
  "enable_bias": true,
  "enable_mlp_block_approx": false,
  "enable_sparse_attn": false,
  "eos_token_id": 2,
  "ffn_dim": 10240,
  "hidden_size": 2560,
  "init_std": 0.02,
  "layer_norm_elementwise_affine": true,
  "layerdrop": 0.0,
  "lora_attn_alpha": 32,
  "lora_attn_dim": 4,
  "lora_dropout": 0.0,
  "lora_r_dropout": 0.0,
  "max_position_embeddings": 2048,
  "merge_lora_weights": true,
  "mlp_block_approx_method": "threshold",
  "mlp_block_approx_threshold": 0.8,
  "mlp_ffn_blk_size": 32,
  "mlp_seq_blk_size": 32,
  "model_type": "opt",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "pad_token_id": 1,
  "prefix": "</s>",
  "sparse_config_block": 32,
  "sparse_config_different_layout_per_head": false,
  "sparse_config_num_heads": 12,
  "torch_dtype": "float32",
  "trace_attn_scores": false,
  "trace_mlp_activations": false,
  "transformers_version": "4.37.2",
  "use_cache": true,
  "vocab_size": 50272,
  "word_embed_proj_dim": 2560
}
